
public class Calculator {
	double result () {
		
	}
	public void add (double first, double second) {
	
	}
	// по аналоги с substruct div multiple
	
System.out.println (result);
}



//Задание 2.
//Нужно сделать файл Calculator.java и создать в нем класс Calculator. в классе должно быть внутреннее поле double result. 
//и четыре метода add(double first, double second) по аналогии substruct div multiple. Методы должны быть void. 
//Каждый метод вычисляет арифметическую операцию и записывает ее в поле result.
//Добавить второй файл CalcInit. В нем сделать main метод и продемонстрировать использование класса Calculator.